fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
  <comment>Календарь загрузки специалистов на базе планировщика. Позволяет планировать обслуживание клиентов прямо из календаря.</comment>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Планирование работ специалиста у клиента и фиксация фактически выполненных работ.</comment>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Допускается только договор вида "Абонентское обслуживание".</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// По умолчанию календарь всегда открыт на текущем дне.
	ОпорнаяДата = НачалоДня(ТекущаяДатаСеанса());

	ПерестроитьКалендарь();

КонецПроцедуры

// Календарь перестраивается при записи документов обслуживания в других формах.
//
// Параметры:
//  ИмяСобытия - Строка       - идентификатор оповещения.
//  Параметр   - Произвольный - параметр оповещения, не используется.
//  Источник   - Произвольный - источник оповещения, не используется.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ВКМ_ЗаписьОбслуживанияКлиента" Тогда
		ПерестроитьКалендарь();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события "ПередСозданием" поля планировщика. Вместо штатного окна
// быстрого создания открывает форму нового обслуживания клиента, заполненную
// специалистом и временем из выделенной в календаре области.
//
// Параметры:
//  Начало               - Дата    - начало выделенной области.
//  Конец                - Дата    - окончание выделенной области.
//  ЗначенияИзмерений    - ФиксированноеСоответствие - значения измерений планировщика.
//  Текст                - Строка  - текст создаваемого элемента.
//  СтандартнаяОбработка - Булево  - признак стандартной обработки события.
//
&НаКлиенте
Процедура ПолеПланировщикаПередСозданием(Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Специалист", ЗначенияИзмерений.Получить("Специалист"));
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаПлан", Начало);
	ЗначенияЗаполнения.Вставить("ВремяОкончанияПлан", Конец);

	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

// Обработчик события "Выбор" поля планировщика: открывает документ обслуживания.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак стандартной обработки события.
//
&НаКлиенте
Процедура ПолеПланировщикаВыбор(СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ВыделенныеЭлементы = Элементы.ПолеПланировщика.ВыделенныеЭлементы;
	Если ВыделенныеЭлементы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Ссылка = ВыделенныеЭлементы[0].Значение;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПоказатьЗначение(, Ссылка);
	КонецЕсли;

КонецПроцедуры

// Запрещает смену дня прокруткой колесом мыши и клавишами.
//
// День календаря задается только кнопкой "Выбрать дату": иначе колесо мыши
// незаметно уводит календарь с выбранного дня.
//
// Параметры:
//  Элемент                   - ПолеФормы - поле планировщика.
//  ТекущиеПериодыОтображения - Массив    - периоды, на которые переключается планировщик.
//  СтандартнаяОбработка      - Булево    - признак стандартной обработки события.
//
&НаКлиенте
Процедура ПолеПланировщикаПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)

	ПерестроитьКалендарь();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДату(Команда)

	// Штатный календарь 1С открывается отдельной формой: в ней подсвечены дни,
	// на которые есть заявки.
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДаты", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Дата", ОпорнаяДата);

	ОткрытьФорму("Обработка.ВКМ_КалендарьСпециалистов.Форма.ФормаВыбораДаты",
		ПараметрыФормы, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

// Обработчик закрытия формы выбора даты.
//
// Параметры:
//  ВыбраннаяДата        - Дата, Неопределено - выбранная дата или отказ от выбора.
//  ДополнительныеДанные - Произвольный       - не используется.
//
&НаКлиенте
Процедура ПослеВыбораДаты(ВыбраннаяДата, ДополнительныеДанные) Экспорт

	Если ТипЗнч(ВыбраннаяДата) = Тип("Дата") И ЗначениеЗаполнено(ВыбраннаяДата) Тогда
		ОткрытьДень(ВыбраннаяДата);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОткрытьДень(Дата)

	ОпорнаяДата = НачалоДня(Дата);
	ПерестроитьКалендарь();

КонецПроцедуры

// Перестраивает календарь целиком: период отображения, шкалу времени,
// измерение "Специалист" и элементы по документам обслуживания.
//
&НаСервере
Процедура ПерестроитьКалендарь()

	Если Не ЗначениеЗаполнено(ОпорнаяДата) Тогда
		ОпорнаяДата = ТекущаяДатаСеанса();
	КонецЕсли;

	НачалоПериода = НачалоДня(ОпорнаяДата);
	КонецПериода = КонецДня(ОпорнаяДата);

	ОформитьПланировщик();
	НастроитьШкалу(ТипЕдиницыШкалыВремени.Час, "ДФ='HH'");

	// Планировщик рисует не границы периода, а перечисленные периоды отображения.
	// Без заполнения этой коллекции поле остается пустым даже при полностью
	// заполненных измерениях и элементах.
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	Планировщик.ОтображатьТекущуюДату = Истина;

	ЗаполнитьКалендарь(НачалоПериода, КонецПериода);

	Заголовок = ЗаголовокКалендаря(НачалоПериода);

КонецПроцедуры

// Задает цвета планировщика явно.
//
// Автоматические цвета планировщика в этой конфигурации разрешаются в белый:
// поле выглядит пустым, хотя измерения и элементы заполнены. Поэтому цвета
// линий, текста и фона задаются значениями, а не значением "Авто".
//
&НаСервере
Процедура ОформитьПланировщик()

	Планировщик.ЦветФона = Новый Цвет(255, 255, 255);
	Планировщик.ЦветЛиний = Новый Цвет(205, 205, 205);
	Планировщик.ЦветРамки = Новый Цвет(205, 205, 205);
	Планировщик.ЦветТекста = Новый Цвет(0, 0, 0);

	// Перенесенные заголовки рисуют слева лишнюю колонку с датой периода.
	Планировщик.ОтображатьПеренесенныеЗаголовки = Ложь;
	Планировщик.ОтображатьПеренесенныеЗаголовкиШкалыВремени = Ложь;

КонецПроцедуры

// Возвращает заголовок формы с датой отображаемого дня.
//
// Параметры:
//  НачалоПериода - Дата - начало отображаемого периода.
//
// Возвращаемое значение:
//  Строка - заголовок формы.
//
&НаСервереБезКонтекста
Функция ЗаголовокКалендаря(НачалоПериода)

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Календарь специалистов: %1'"), Формат(НачалоПериода, "ДЛФ=DD"));

КонецФункции

// Настраивает шкалу времени планировщика под выбранный масштаб.
//
// Настройки планировщика хранятся у реквизита формы и в формате исходников
// EDT не сохраняются, поэтому шкала задается программно при каждой перестройке.
//
// Параметры:
//  Единица - ТипЕдиницыШкалыВремени - единица деления шкалы.
//  Формат  - Строка                 - формат подписей делений.
//
&НаСервере
Процедура НастроитьШкалу(Единица, Формат)

	Пока Планировщик.ШкалаВремени.Элементы.Количество() < 1 Цикл
		Планировщик.ШкалаВремени.Элементы.Добавить();
	КонецЦикла;

	Деление = Планировщик.ШкалаВремени.Элементы.Получить(0);
	Деление.Единица = Единица;
	Деление.Кратность = 1;
	Деление.Видимость = Истина;
	Деление.Формат = Формат;

	// Шкала времени сверху: колонки - часы, строки - специалисты.
	Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;
	Планировщик.ШкалаВремени.ЦветТекста = Новый Цвет(0, 0, 0);

	// Без явных минимальных размеров деления схлопываются и заявки не видны.
	Планировщик.АвтоМинимальнаяШиринаКолонки = Ложь;
	// Сутки должны помещаться в ширину поля без горизонтальной прокрутки.
	Планировщик.МинимальнаяШиринаКолонки = ?(Единица = ТипЕдиницыШкалыВремени.День, 8, 4);
	Планировщик.АвтоМинимальнаяВысотаСтроки = Ложь;
	Планировщик.МинимальнаяВысотаСтроки = 3;
	Планировщик.ФиксироватьЗаголовокИзмерений = Истина;
	Планировщик.ФиксироватьЗаголовокШкалыВремени = Истина;

КонецПроцедуры

// Перестраивает содержимое календаря: измерение "Специалист" со списком
// специалистов и элементы планировщика по документам обслуживания.
//
// Параметры:
//  НачалоПериода - Дата - начало отображаемого периода.
//  КонецПериода  - Дата - окончание отображаемого периода.
//
&НаСервере
Процедура ЗаполнитьКалендарь(НачалоПериода, КонецПериода)

	Планировщик.Элементы.Очистить();
	Планировщик.Измерения.Очистить();

	// Значение измерения задается параметром метода Добавить: свойство Значение
	// доступно только для чтения.
	Измерение = Планировщик.Измерения.Добавить("Специалист", НСтр("ru = 'Специалист'"));

	ДанныеКалендаря = ДанныеОбслуживаний(НачалоПериода, КонецПериода);

	Для Каждого Специалист Из ДанныеКалендаря.Специалисты Цикл
		Измерение.Элементы.Добавить(Специалист, Строка(Специалист));
	КонецЦикла;

	Для Каждого Обслуживание Из ДанныеКалендаря.Обслуживания Цикл

		ЭлементПланировщика = Планировщик.Элементы.Добавить(
			Обслуживание.Начало, Обслуживание.Окончание);
		ЭлементПланировщика.Значение = Обслуживание.Ссылка;
		ЭлементПланировщика.Текст = Обслуживание.Представление;
		ЭлементПланировщика.Подсказка = Обслуживание.Проблема;
		ЭлементПланировщика.ЦветФона = Новый Цвет(198, 224, 180);
		ЭлементПланировщика.ЦветРамки = Новый Цвет(112, 173, 71);
		ЭлементПланировщика.ЦветТекста = Новый Цвет(0, 0, 0);

		ЗначенияИзмерений = Новый Соответствие;
		ЗначенияИзмерений.Вставить("Специалист", Обслуживание.Специалист);
		ЭлементПланировщика.ЗначенияИзмерений = Новый ФиксированноеСоответствие(ЗначенияИзмерений);

	КонецЦикла;

КонецПроцедуры

// Получает данные для построения календаря одним запросом.
//
// Параметры:
//  НачалоПериода - Дата - начало отображаемого периода.
//  КонецПериода  - Дата - окончание отображаемого периода.
//
// Возвращаемое значение:
//  Структура - данные календаря:
//   * Специалисты  - Массив из СправочникСсылка.ВКМ_Сотрудники - специалисты для измерения.
//   * Обслуживания - ТаблицаЗначений - документы обслуживания с рассчитанным временем.
//
&НаСервереБезКонтекста
Функция ДанныеОбслуживаний(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Обслуживание.Ссылка КАК Ссылка,
		|	Обслуживание.Специалист КАК Специалист,
		|	Обслуживание.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	Обслуживание.ВремяНачалаПлан КАК ВремяНачалаПлан,
		|	Обслуживание.ВремяОкончанияПлан КАК ВремяОкончанияПлан,
		|	Обслуживание.Клиент КАК Клиент,
		|	Обслуживание.ОписаниеПроблемы КАК ОписаниеПроблемы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
		|ГДЕ
		|	НЕ Обслуживание.ПометкаУдаления
		|	И Обслуживание.ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Обслуживание.Специалист <> ЗНАЧЕНИЕ(Справочник.ВКМ_Сотрудники.ПустаяСсылка)
		|;
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И Сотрудники.Категория = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииСотрудников.Специалист)
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудники.Наименование";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));

	Результаты = Запрос.ВыполнитьПакет();

	Обслуживания = Новый ТаблицаЗначений;
	Обслуживания.Колонки.Добавить("Ссылка");
	Обслуживания.Колонки.Добавить("Специалист");
	Обслуживания.Колонки.Добавить("Начало");
	Обслуживания.Колонки.Добавить("Окончание");
	Обслуживания.Колонки.Добавить("Представление");
	Обслуживания.Колонки.Добавить("Проблема");

	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл

		Дата = НачалоДня(Выборка.ДатаПроведенияРабот);
		Начало = ?(ЗначениеЗаполнено(Выборка.ВремяНачалаПлан),
			Дата + (Выборка.ВремяНачалаПлан - НачалоДня(Выборка.ВремяНачалаПлан)), Дата + 9 * 3600);
		Окончание = ?(ЗначениеЗаполнено(Выборка.ВремяОкончанияПлан),
			Дата + (Выборка.ВремяОкончанияПлан - НачалоДня(Выборка.ВремяОкончанияПлан)), Начало + 3600);

		Если Окончание <= Начало Тогда
			Окончание = Начало + 3600;
		КонецЕсли;

		СтрокаОбслуживания = Обслуживания.Добавить();
		СтрокаОбслуживания.Ссылка = Выборка.Ссылка;
		СтрокаОбслуживания.Специалист = Выборка.Специалист;
		СтрокаОбслуживания.Начало = Начало;
		СтрокаОбслуживания.Окончание = Окончание;
		СтрокаОбслуживания.Представление = Строка(Выборка.Клиент);
		СтрокаОбслуживания.Проблема = Выборка.ОписаниеПроблемы;

	КонецЦикла;

	Специалисты = Новый Массив;
	ВыборкаСпециалистов = Результаты[1].Выбрать();
	Пока ВыборкаСпециалистов.Следующий() Цикл
		Специалисты.Добавить(ВыборкаСпециалистов.Ссылка);
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("Специалисты", Специалисты);
	Данные.Вставить("Обслуживания", Обслуживания);

	Возврат Данные;

КонецФункции

#КонецОбласти
